Siia hakkab ilmuma projekt.

In [1]:
import pandas as pd

In [2]:
pd.read_excel('Tabel.xlsx', index_col=0)

,idcode,laps_id_code,ema_synnikuupev,emavanus,synnikaal,Synnitus,KAAL_ENNE,PIKKUS,BMI,DM,GDM_jm2,GDM
A,,,,,,,,,,,,
1,4750811,6190101,11.08.1975,43.392197,4180,2019-01-01,70.0,164.0,26.026175,NaN,2,0
2,4761223,5180513,23.12.1976,41.385352,625,2018-05-13,84.0,171.0,28.726788,NaN,1,0
3,4770830,5190311,30.08.1977,41.527721,3764,2019-03-11,75.0,164.0,27.885187,NaN,2,0
4,4810319,6190303,19.03.1981,37.954825,3640,2019-03-03,54.0,172.0,18.253110,NaN,3,1
5,4820215,5180718,15.02.1982,36.418891,2926,2018-07-18,68.9,172.0,23.289616,NaN,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...
2022,4930414,6190318,14.04.1993,25.924709,3300,2019-03-18,78.0,171.0,26.674874,NaN,2,0
2023,4911114,6180805,14.11.1991,26.724162,2635,2018-08-05,72.0,162.0,27.434842,NaN,1,0
2024,4930519,5190531,19.05.1993,26.031485,3750,2019-05-31,53.0,158.0,21.230572,NaN,2,0
2026,4850213,5190105,13.02.1985,33.891855,3475,2019-01-05,57.4,165.0,21.083563,NaN,0,0
2027,4970911,5190405,11.09.1997,21.563313,4035,2019-04-05,68.0,162.0,25.910684,NaN,2,0